; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	thermograph0 - mode
	spectrograph6 - mode
	image7 - mode
	spectrograph4 - mode
	thermograph2 - mode
	spectrograph3 - mode
	image5 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 spectrograph6)
	(supports instrument3 image7)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph6)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image7)
	(supports instrument5 image5)
	(supports instrument5 spectrograph6)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument6 spectrograph6)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 Star0)
	(pointing satellite4 Phenomenon9)
	(pointing satellite5 GroundStation2)
	(have_image Phenomenon6 spectrograph1)
	(have_image Planet7 image7)
	(have_image Planet7 spectrograph1)
	(have_image Star8 image5)
	(have_image Phenomenon9 spectrograph6)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 image5)
	(have_image Phenomenon10 spectrograph6)
))

)

; plan
1. (turn_to satellite4 star0 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star0)
   goals met: 0 of 12
2. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 12
3. (calibrate satellite4 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 0 of 12
4. (turn_to satellite4 phenomenon6 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon6)
   goals met: 0 of 12
5. (turn_to satellite3 groundstation2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 12
6. (turn_to satellite2 star0 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star0)
   goals met: 1 of 12
7. (turn_to satellite0 star5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star5)
   goals met: 2 of 12
8. (take_image satellite4 phenomenon6 instrument6 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 3 of 12
9. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 3 of 12
10. (calibrate satellite3 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 3 of 12
11. (turn_to satellite3 phenomenon10 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon10)
   goals met: 3 of 12
12. (take_image satellite3 phenomenon10 instrument5 image5)
   added: (have_image phenomenon10 image5)
   goals met: 4 of 12
13. (take_image satellite3 phenomenon10 instrument5 spectrograph6)
   added: (have_image phenomenon10 spectrograph6)
   goals met: 5 of 12
14. (turn_to satellite3 planet7 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet7)
   goals met: 5 of 12
15. (take_image satellite3 planet7 instrument5 image7)
   added: (have_image planet7 image7)
   goals met: 6 of 12
16. (turn_to satellite3 star8 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star8)
   goals met: 6 of 12
17. (take_image satellite3 star8 instrument5 image5)
   added: (have_image star8 image5)
   goals met: 7 of 12
18. (turn_to satellite4 planet7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet7)
   goals met: 7 of 12
19. (take_image satellite4 planet7 instrument6 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 8 of 12
20. (turn_to satellite4 phenomenon9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 phenomenon9)
   goals met: 9 of 12
21. (take_image satellite4 phenomenon9 instrument6 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 10 of 12
22. (take_image satellite4 phenomenon9 instrument6 spectrograph6)
   added: (have_image phenomenon9 spectrograph6)
   goals met: 11 of 12
23. (turn_to satellite5 groundstation2 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 groundstation2)
   goals met: 12 of 12
